Thank You for such a quick response @marcinkaluza .

I was able to create all resources:

```
Terraform will perform the following actions:

  # stripe_portal_configuration.portal_configuration will be created
  + resource "stripe_portal_configuration" "portal_configuration" {
      + active             = true
      + default_return_url = "https://www.google.com"
      + id                 = (known after apply)
      + is_default         = (known after apply)

      + business_profile {
          + headline             = "Octank partners with Stripe to provide your billing"
          + privacy_policy_url   = "https://www.google.com/privacy"
          + terms_of_service_url = "https://www.google.com/tos"
        }

      + features {
          + customer_update {
              + allowed_updates = [
                  + "email",
                  + "address",
                  + "name",
                ]
              + enabled         = true
            }
          + invoice_history {
              + enabled = true
            }
          + payment_method_update {
              + enabled = true
            }
          + subscription_cancel {
              + enabled            = true
              + mode               = "immediately"
              + proration_behavior = "create_prorations"

              + cancellation_reason {
                  + enabled = true
                  + options = [
                      + "too_expensive",
                      + "missing_features",
                      + "switched_service",
                      + "unused",
                      + "low_quality",
                      + "other",
                    ]
                }
            }
          + subscription_update {
              + default_allowed_updates = [
                  + "price",
                  + "promotion_code",
                ]
              + enabled                 = true
              + proration_behavior      = "create_prorations"

              + products {
                  + prices  = (known after apply)
                  + product = (known after apply)
                }
            }
        }

      + login_page (known after apply)
    }

  # stripe_price.standard_monthly will be created
  + resource "stripe_price" "standard_monthly" {
      + active              = true
      + billing_scheme      = (known after apply)
      + currency            = "gbp"
      + id                  = (known after apply)
      + product             = (known after apply)
      + tax_behavior        = "unspecified"
      + transfer_lookup_key = false
      + type                = (known after apply)
      + unit_amount         = 599
      + unit_amount_decimal = (known after apply)

      + recurring {
          + interval       = "month"
          + interval_count = 1
          + usage_type     = "licensed"
        }
    }

  # stripe_price.standard_yearly will be created
  + resource "stripe_price" "standard_yearly" {
      + active              = true
      + billing_scheme      = (known after apply)
      + currency            = "gbp"
      + id                  = (known after apply)
      + product             = (known after apply)
      + tax_behavior        = "unspecified"
      + transfer_lookup_key = false
      + type                = (known after apply)
      + unit_amount         = 5999
      + unit_amount_decimal = (known after apply)

      + recurring {
          + interval       = "year"
          + interval_count = 1
          + usage_type     = "licensed"
        }
    }

  # stripe_product.standard will be created
  + resource "stripe_product" "standard" {
      + active             = true
      + description        = "Our standard simple plan"
      + id                 = (known after apply)
      + marketing_features = [
          + "Infinite Free Trial",
          + "Overachiever Dashboard",
          + "Dark Mode+",
          + "Passive-Aggressive Notifications",
          + "One-Click Rage Quit",
        ]
      + name               = "Standard"
      + product_id         = (known after apply)
      + shippable          = false
    }

  # stripe_webhook_endpoint.webhook will be created
  + resource "stripe_webhook_endpoint" "webhook" {
      + application    = (known after apply)
      + connect        = false
      + disabled       = false
      + enabled_events = [
          + "charge.succeeded",
          + "charge.failed",
          + "source.chargeable",
          + "customer.created",
          + "customer.updated",
          + "customer.deleted",
          + "customer.subscription.updated",
          + "customer.subscription.resumed",
          + "customer.subscription.paused",
          + "customer.subscription.deleted",
          + "customer.subscription.created",
        ]
      + id             = (known after apply)
      + secret         = (sensitive value)
      + url            = "https://www.google.com/api/stripe/hook"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

stripe_webhook_endpoint.webhook: Creating...
stripe_product.standard: Creating...
stripe_product.standard: Creation complete after 0s [id=prod_T6K2601Xh2YUsg]
stripe_price.standard_yearly: Creating...
stripe_price.standard_monthly: Creating...
stripe_webhook_endpoint.webhook: Creation complete after 0s [id=we_1SA7OHFTpIuUjmTAafQ1YPB4]
stripe_price.standard_yearly: Creation complete after 1s [id=price_1SA7OHFTpIuUjmTArdzESl6L]
stripe_price.standard_monthly: Creation complete after 1s [id=price_1SA7OHFTpIuUjmTAbEz2daBi]
stripe_portal_configuration.portal_configuration: Creating...
stripe_portal_configuration.portal_configuration: Creation complete after 1s [id=bpc_1SA7OIFTpIuUjmTA1CClTgyD]

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.         
```

And also destroy:

```
Terraform will perform the following actions:

  # stripe_portal_configuration.portal_configuration will be destroyed
  - resource "stripe_portal_configuration" "portal_configuration" {
      - active             = true -> null
      - default_return_url = "https://www.google.com" -> null
      - id                 = "bpc_1SA7OIFTpIuUjmTA1CClTgyD" -> null
      - is_default         = false -> null
      - metadata           = {} -> null

      - business_profile {
          - headline             = "Octank partners with Stripe to provide your billing" -> null
          - privacy_policy_url   = "https://www.google.com/privacy" -> null
          - terms_of_service_url = "https://www.google.com/tos" -> null
        }

      - features {
          - customer_update {
              - allowed_updates = [
                  - "email",
                  - "address",
                  - "name",
                ] -> null
              - enabled         = true -> null
            }
          - invoice_history {
              - enabled = true -> null
            }
          - payment_method_update {
              - enabled = true -> null
            }
          - subscription_cancel {
              - enabled            = true -> null
              - mode               = "immediately" -> null
              - proration_behavior = "create_prorations" -> null

              - cancellation_reason {
                  - enabled = true -> null
                  - options = [
                      - "too_expensive",
                      - "missing_features",
                      - "switched_service",
                      - "unused",
                      - "low_quality",
                      - "other",
                    ] -> null
                }
            }
          - subscription_update {
              - default_allowed_updates = [
                  - "price",
                  - "promotion_code",
                ] -> null
              - enabled                 = true -> null
              - proration_behavior      = "create_prorations" -> null

              - products {
                  - prices  = [
                      - "price_1SA7OHFTpIuUjmTAbEz2daBi",
                      - "price_1SA7OHFTpIuUjmTArdzESl6L",
                    ] -> null
                  - product = "prod_T6K2601Xh2YUsg" -> null
                }
            }
        }

      - login_page {
          - enabled = false -> null
            # (1 unchanged attribute hidden)
        }
    }

  # stripe_price.standard_monthly will be destroyed
  - resource "stripe_price" "standard_monthly" {
      - active              = true -> null
      - billing_scheme      = "per_unit" -> null
      - currency            = "gbp" -> null
      - id                  = "price_1SA7OHFTpIuUjmTAbEz2daBi" -> null
      - metadata            = {} -> null
      - product             = "prod_T6K2601Xh2YUsg" -> null
      - tax_behavior        = "unspecified" -> null
      - transfer_lookup_key = false -> null
      - type                = "recurring" -> null
      - unit_amount         = 599 -> null
        # (3 unchanged attributes hidden)

      - recurring {
          - interval        = "month" -> null
          - interval_count  = 1 -> null
          - usage_type      = "licensed" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # stripe_price.standard_yearly will be destroyed
  - resource "stripe_price" "standard_yearly" {
      - active              = true -> null
      - billing_scheme      = "per_unit" -> null
      - currency            = "gbp" -> null
      - id                  = "price_1SA7OHFTpIuUjmTArdzESl6L" -> null
      - metadata            = {} -> null
      - product             = "prod_T6K2601Xh2YUsg" -> null
      - tax_behavior        = "unspecified" -> null
      - transfer_lookup_key = false -> null
      - type                = "recurring" -> null
      - unit_amount         = 5999 -> null
        # (3 unchanged attributes hidden)

      - recurring {
          - interval        = "year" -> null
          - interval_count  = 1 -> null
          - usage_type      = "licensed" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # stripe_product.standard will be destroyed
  - resource "stripe_product" "standard" {
      - active               = true -> null
      - description          = "Our standard simple plan" -> null
      - id                   = "prod_T6K2601Xh2YUsg" -> null
      - images               = [] -> null
      - marketing_features   = [
          - "Infinite Free Trial",
          - "Overachiever Dashboard",
          - "Dark Mode+",
          - "Passive-Aggressive Notifications",
          - "One-Click Rage Quit",
        ] -> null
      - metadata             = {} -> null
      - name                 = "Standard" -> null
      - product_id           = "prod_T6K2601Xh2YUsg" -> null
      - shippable            = false -> null
        # (3 unchanged attributes hidden)
    }

  # stripe_webhook_endpoint.webhook will be destroyed
  - resource "stripe_webhook_endpoint" "webhook" {
      - connect        = false -> null
      - disabled       = false -> null
      - enabled_events = [
          - "charge.succeeded",
          - "charge.failed",
          - "source.chargeable",
          - "customer.created",
          - "customer.updated",
          - "customer.deleted",
          - "customer.subscription.updated",
          - "customer.subscription.resumed",
          - "customer.subscription.paused",
          - "customer.subscription.deleted",
          - "customer.subscription.created",
        ] -> null
      - id             = "we_1SA7OHFTpIuUjmTAafQ1YPB4" -> null
      - metadata       = {} -> null
      - secret         = (sensitive value) -> null
      - url            = "https://www.google.com/api/stripe/hook" -> null
        # (3 unchanged attributes hidden)
    }

Plan: 0 to add, 0 to change, 5 to destroy.

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

stripe_webhook_endpoint.webhook: Destroying... [id=we_1SA7OHFTpIuUjmTAafQ1YPB4]
stripe_portal_configuration.portal_configuration: Destroying... [id=bpc_1SA7OIFTpIuUjmTA1CClTgyD]
stripe_portal_configuration.portal_configuration: Destruction complete after 0s
stripe_price.standard_yearly: Destroying... [id=price_1SA7OHFTpIuUjmTArdzESl6L]
stripe_price.standard_monthly: Destroying... [id=price_1SA7OHFTpIuUjmTAbEz2daBi]
stripe_webhook_endpoint.webhook: Destruction complete after 0s
stripe_price.standard_monthly: Destruction complete after 1s
stripe_price.standard_yearly: Destruction complete after 1s
stripe_product.standard: Destroying... [id=prod_T6K2601Xh2YUsg]
stripe_product.standard: Destruction complete after 0s

Destroy complete! Resources: 5 destroyed.    
```

**Is there anything I am missing on my side, which is causing the blockage with destroy/de-activation?**

Cheers,
Lukas